Taskly-JavaScript/app/views/task_lists/index.html.erb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."task_list_id" = $1  [["task_list_id", 9]]
---
    <div class="accord_body">
    <% task_list.tasks.each do |task| %>