Taskly-JavaScript/app/controllers/tasks_controller.rb

  def new
    # @task.task_list_id = @task_list.id
    # @users = User.all

    @task_list = TaskList.find(params[:task_list_id])
---
SELECT  "task_lists".* FROM "task_lists"  WHERE "task_lists"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    puts"="*50
    puts params
    puts params[:task][:date]
    puts"="*50


    # due_date = Date.new(
    #   params[:task]["date(1i)"].to_i,
    #   params[:task]["date(2i)"].to_i,
    #   params[:task]["date(3i)"].to_i
    # )


    # @task_list = TaskList.find(params[:task_list_id])
    # @users = User.all
    # @task.task_list_id = params[:task_list_id]
    @task = Task.new(
      description: params[:task][:description],
      date: params[:task][:date],
      task_list_id: params[:task_list_id])

    if @task.save
      redirect_to root_path

      # flash[:notice]= "Task was created successfully!"

    else
      @task_list = TaskList.find(params[:task_list_id])
---
INSERT INTO "tasks" ("date", "description", "task_list_id") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2014-08-07"], ["description", "do something"], ["task_list_id", 9]]
SELECT  "task_lists".* FROM "task_lists"  WHERE "task_lists"."id" = $1 LIMIT 1  [["id", 10]]