Taskly-JavaScript/app/controllers/task_lists_controller.rb

  def index
    @task_lists = TaskList.order(:name)
---
SELECT "task_lists".* FROM "task_lists"   ORDER BY "task_lists"."name" ASC

  def show

    @task_list = TaskList.find(params[:id])
---
SELECT  "task_lists".* FROM "task_lists"  WHERE "task_lists"."id" = $1 LIMIT 1  [["id", 10]]

  def create
    @task_list = TaskList.new(name: params[:task_list][:name]) #nested hash!!!
    if @task_list.save
---
INSERT INTO "task_lists" ("name") VALUES ($1) RETURNING "id"  [["name", "what?"]]

  def edit
    @task_list = TaskList.find(params[:id])
---
SELECT  "task_lists".* FROM "task_lists"  WHERE "task_lists"."id" = $1 LIMIT 1  [["id", 14]]

  def update
    @task_list = TaskList.find(params[:id])
    if @task_list.update(name: params[:task_list][:name])
---
SELECT  "task_lists".* FROM "task_lists"  WHERE "task_lists"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "task_lists" SET "name" = $1 WHERE "task_lists"."id" = 15  [["name", "task2"]]